// 1. Страница со списком пользователей.
// 1.1 Есть список карточек пользователей. На карточке есть информация (имя, username, почта и телефон)
// 1.2 На странице есть поиск по пользователям
// 1.3 По клику на карточку пользователя осуществляется переход на страницу пользователя
// 2. Страница пользователя.
// 2.1 На странице два блока: информация о пользователе и блок с вкладками (альбомы и тудушки)
// 3. Вкладка тудушек пользователя
// 3.1 На вкладке отображается список тудушек пользователя
// 3.2 Каждая тудушка имеет чекбокс выполнено\невыполнено. При нажатии на чекбокс она тудушка меняет свой статус выполнено\невыполнено
// 4. Вкладка альбомов пользователя
// 4.1 На вкладке отображаются альбомы пользователя. По клику открывается один альбом
// 5. Страница одного альбома пользователя
// 5.1 На странице отображаются фотографии из альбома пользователя
// 5.2 По клику на фотографию открывается превью фотографии на весь экран
// Требования
// 1. Работа с АПИ
// 2. Роутинг
// 3. SCSS
// 4. Сделать по правилам Gitflow
// Критерии оценки
// 1. Чистый читаемый код (SOLID)
// 2. Правильная организация компонентов и файлов в проекте
// 3. Работоспособность требуемых функций
// 4. Стараться переиспользовать UI компоненты (кнопки, инпуты и прочее)
